In [1]:
people = {
    "first":["Samma","soni","saniya","adam"],
    "last":["ali","khatoon","firdous","firdous"],
    "email":["sammakhatoon677@gmail.com","sonibegam23@gmail.com", "saniyafirdous456@gmail.com","adamfirdous@gmail.com"]
}

In [2]:
import pandas as pd

In [3]:
df=pd.DataFrame(people)

In [4]:
df

    first     last                       email
0   Samma      ali   sammakhatoon677@gmail.com
1    soni  khatoon       sonibegam23@gmail.com
2  saniya  firdous  saniyafirdous456@gmail.com
3    adam  firdous       adamfirdous@gmail.com

In [5]:
df.sort_values(by='last')

    first     last                       email
0   Samma      ali   sammakhatoon677@gmail.com
2  saniya  firdous  saniyafirdous456@gmail.com
3    adam  firdous       adamfirdous@gmail.com
1    soni  khatoon       sonibegam23@gmail.com

In [6]:
df.sort_values(by='last',ascending=False)

    first     last                       email
1    soni  khatoon       sonibegam23@gmail.com
2  saniya  firdous  saniyafirdous456@gmail.com
3    adam  firdous       adamfirdous@gmail.com
0   Samma      ali   sammakhatoon677@gmail.com

In [9]:
df.sort_values(by=['last','first'],ascending=[False,True],inplace=True)

In [10]:
df

    first     last                       email
1    soni  khatoon       sonibegam23@gmail.com
3    adam  firdous       adamfirdous@gmail.com
2  saniya  firdous  saniyafirdous456@gmail.com
0   Samma      ali   sammakhatoon677@gmail.com

In [11]:
df.sort_index()

    first     last                       email
0   Samma      ali   sammakhatoon677@gmail.com
1    soni  khatoon       sonibegam23@gmail.com
2  saniya  firdous  saniyafirdous456@gmail.com
3    adam  firdous       adamfirdous@gmail.com

In [12]:
df['last'].sort_values()

0        ali
3    firdous
2    firdous
1    khatoon
Name: last, dtype: object